# 此项配置用于设置图像识别接口API
CLASSIFICATION_API_NAME = 'baidu'


"""
此块设置用于记录百度API的语音合成相关信息
如更换API，请注册新的配置文件
"""

# 此项配置用于设置语音合成API选用的接口
SPEAKER_API_NAME = 'baidu'

# 此项配置用于设置语音合成的语速 取值为0-9 其中5为中等水平语速
SPEAKER_SPEAK_SPEED = 5

# 此项配置用于设置语音合成的语调，取值为0-9，其中5为中等水平语调
SPEAKER_SPEAK_TONE = 5

# 此项配置用于设置语音合成的音量，取值0-15，其中5为中等水平音量
SPEAKER_SPEAK_VOL = 5

# 此项配置用于设置语音合成的人声选择，0为女声，1为男声，3为情感合成男声，4为情感合成女声
SPEAKER_SPEAK_PERSON = 0
# -----------------------------------------------------------------------

# 此项配置为各类API规定的语音合成单次最大合成文字数量，不可改动！
# 如果增加了新的语音合成API，应在此处注册新的长度
SPEAKER_SPEAK_MAX_LEN = {
    'baidu': 150
}

# 此项配置用于设置语音生成模块生产mp3文件存放的位置
AUDIO_FILE_PATH = 'audio.mp3'

# 此项配置用于设置图片的编码方式，根据不同调用api的要求进行改写
IMG_ENCODING_PATTERN = 'base64'

# 此项配置用于设置静态图片的路径
IMG_PATH = 'test/1.jpg'

# 此项配置用于设置图片识别的模式，static指通过读取图片文件的形式识别，stream指通过二进制流进行识别
CLASSIFIER_PATTERN = 'static'

# 此项配置数据库的搜索模式，默认为db，其他方式暂未开发
SEARCH_TYPE = 'db'

"""
本块配置用于设置摄像头相关的信息
"""
# 此项配置用于设置选用的摄像头，一般单摄像头的情况下，此值默认为0，无须修改
# 当有多摄像头，需选用其他摄像头时，可以更改此项配置
# 当有多摄像头同时读取需求时，可将本参数更改为其他数据结构，并在HardWare中
# 主动继承Camera类并深度改写其中的方法

CAMERA_NUM = 0
# -----------------------------------------------------------------------

"""此项配置用于设置拍照的照片存储的路径
默认情况下，此项配置与图片识别存储的路径保持一致
值得说明的是，这意味着本项目同一时间只存在一张序列化的图片
"""

PICTURE_SAVED_PATH = IMG_PATH
# -----------------------------------------------------------------------

# 此项配置用于设置显示在GUI界面上的图像大小
IMAGE_SIZE_FOR_SCREEN = (1, 1)

# 此项配置用于设置保存图片的分辨率大小
IMAGE_SIZE_FOR_SAVED = (1, 1)

# 本项配置用于设定图像识别的阈值，阈值越高，对结果的要求越苛刻.
CLASSIFIER_THRESHOULD = 0.1

# 本项配置用于设定在识别失败后，最大的重新尝试次数.
MAX_ROTATE_TIME = 3

# 本项配置用于设定静态资源的目录
STATIC_FILE_PATH = 'static'

# 本项配置用于设置最大的static资源缓存数目
MAX_CACHE_NUM = 5
